src/Documents/Scan_ЗакреплениеМенеджеровОКПЗаДилерами/Scan_ЗакреплениеМенеджеровОКПЗаДилерами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЗакреплениеМенеджеровОКПЗаДилерами</name>
  <registerRecords>InformationRegister.Scan_ЗакреплениеМенеджеровОКПЗаДилерами</registerRecords>
  <attributes>
    <name>НомерРаспоряжения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРаспоряжения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Менеджеры</name>
    <attributes>
      <name>Дилер</name>
      <type>
        <types>CatalogRef.Scan_Компании</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Scan_Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Scan_ЗакреплениеМенеджеровОКПЗаДилерами/Scan_ЗакреплениеМенеджеровОКПЗаДилерами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ЗакреплениеМенеджеровОКПЗаДилерами</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дилер</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/Scan_ЗакреплениеМенеджеровОКПЗаДилерами/ManagerModule.bsl
&НаСервере
Функция ПолучитьЗакрепленногоМенеджера(Дилер) Экспорт
	
	ЗакрепленныйМенеджер = Справочники.Scan_Сотрудники.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Дилер);
	Запрос.Текст = "ВЫБРАТЬ
	|	Scan_ЗакреплениеМенеджеровОКПЗаДилерамиСрезПоследних.Менеджер КАК Менеджер
	|ИЗ
	|	РегистрСведений.Scan_ЗакреплениеМенеджеровОКПЗаДилерами.СрезПоследних(, Дилер = &Ссылка) КАК Scan_ЗакреплениеМенеджеровОКПЗаДилерамиСрезПоследних";
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗакрепленныйМенеджер = ВыборкаДетальныеЗаписи.Менеджер;
	КонецЕсли;
	
	Возврат ЗакрепленныйМенеджер;
	
КонецФункции
